Белгипрозем_2017/src/InformationRegisters/НастройкаШаблоновБизнесПроцессов/НастройкаШаблоновБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаШаблоновБизнесПроцессов</name>
  <resources>
    <name>ЗапрещеноИзменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтерактивныйЗапуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидИнтерактивногоСобытия</name>
    <type>
      <types>EnumRef.ВидыИнтерактивныхДействий</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонБизнесПроцесса</name>
    <type>
      <types>CatalogRef.ШаблоныУтверждения</types>
      <types>CatalogRef.ШаблоныОзнакомления</types>
      <types>CatalogRef.ШаблоныСоставныхБизнесПроцессов</types>
      <types>CatalogRef.ШаблоныРассмотрения</types>
      <types>CatalogRef.ШаблоныСогласования</types>
      <types>CatalogRef.ШаблоныПоручения</types>
      <types>CatalogRef.ШаблоныКомплексныхБизнесПроцессов</types>
      <types>CatalogRef.ШаблоныИсполнения</types>
      <types>CatalogRef.ШаблоныРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Условие</name>
    <type>
      <types>CatalogRef.УсловияМаршрутизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/CommonModules/ИнтерактивныйЗапускБизнесПроцессов/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Программный интерактивного запуска бизнес-процессов

// Получает шаблоны для автозапуска интерактивного
Функция ПолучитьШаблоныДляАвтоЗапуска(ВидИнтерактивногоБизнесСобытия, ВидДокумента, Организация, Документ) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НастройкаШаблоновБизнесПроцессов.ШаблонБизнесПроцесса КАК ШаблонБизнесПроцесса,
	               |	НастройкаШаблоновБизнесПроцессов.ВидДокумента,
	               |	НастройкаШаблоновБизнесПроцессов.ИнтерактивныйЗапуск,
	               |	НастройкаШаблоновБизнесПроцессов.ВидИнтерактивногоСобытия,
	               |	НастройкаШаблоновБизнесПроцессов.Условие
	               |ИЗ
	               |	РегистрСведений.НастройкаШаблоновБизнесПроцессов КАК НастройкаШаблоновБизнесПроцессов
	               |ГДЕ
	               |	НастройкаШаблоновБизнесПроцессов.ВидДокумента = &ВидДокумента
	               |	И (НастройкаШаблоновБизнесПроцессов.Организация = &Организация
	               |			ИЛИ НастройкаШаблоновБизнесПроцессов.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
				   |			ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
	               |	И НастройкаШаблоновБизнесПроцессов.ИнтерактивныйЗапуск = ИСТИНА
	               |	И НастройкаШаблоновБизнесПроцессов.ВидИнтерактивногоСобытия = &ВидИнтерактивногоСобытия";
				   
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.УстановитьПараметр("ВидИнтерактивногоСобытия", ВидИнтерактивногоБизнесСобытия);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям") Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе	
		Запрос.УстановитьПараметр("Организация", Неопределено);
	КонецЕсли;	
	
	Таблица = Запрос.Выполнить().Выгрузить();	
	
	СписокЗначений = Новый СписокЗначений;
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Для Каждого Строка Из Таблица Цикл
		
		Если ДокументооборотПраваДоступа.ПолучитьПраваПоОбъекту(Строка.ШаблонБизнесПроцесса).Чтение Тогда
			
			// Проверим условие маршрутизации
			Если РаботаСУсловиямиМаршрутизации.ПроверитьПрименимостьУсловияМаршрутизацииКОбъекту(Документ, Строка.Условие) Тогда
				
				СписокЗначений.Добавить(Строка.ШаблонБизнесПроцесса, Строка(Строка.ШаблонБизнесПроцесса), Истина);
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат СписокЗначений;
	
КонецФункции
